# Reading Data

* Python has a large number of different ways to read data from external files. 
* Python supports almost any type of file you can think of, from simple text files to complex binary formats.
* In this class we are going to mainly use the pakages `Astropy` and `Pandas` to load extrnal files.
* Both of these packages create a python object called a **Table**.
* **Tables** are very useful, since there are lots of built-in methods that allow us to easily manipulate the data.

In [1]:
import os

# The `AstroPy` package - `QTable`

In [2]:
import numpy as np

from astropy.table import QTable

In [3]:
os.listdir()

['.git',
 '.gitignore',
 '.ipynb_checkpoints',
 '00_UnixNotes.txt',
 'Astro_Coordinates.pdf',
 'Doctor.csv',
 'Emily_Farr_IntroPython.ipynb',
 'Emily_Farr_ReadingData-Copy1.ipynb',
 'Emily_Farr_ReadingData.ipynb',
 'FirstLast_IntroPython.ipynb',
 'FirstLast_Strings.ipynb',
 'FirstLast_Units.ipynb',
 'GOLF',
 'images',
 'LICENSE',
 'MainBelt.csv',
 'Mess.csv',
 'MyData',
 'NewPlanets.csv',
 'NewPlanets2.csv',
 'Planets.csv',
 'Python_Introduction.ipynb',
 'Python_ReadingData.ipynb',
 'Python_StringsAndStuff.ipynb',
 'Python_Units.ipynb',
 'README.md',
 'RegEx.bash',
 'RegExCheet.pdf',
 'RegEx_Assignment.txt',
 'RegEx_Notes.txt',
 'Sillybus.pdf',
 'StyleGuide.ipynb',
 'TestMyComputer.ipynb',
 'UnixCommands.pdf',
 'words.txt']

In [4]:
planet_table = QTable.read('Planets.csv', format='ascii.csv')

In [5]:
planet_table

<QTable length=9>
  Name     a      col2
  str7  float64 float64
------- ------- -------
Mercury  0.3871  0.2056
  Venus  0.7233  0.0068
  Earth  0.9991  0.0166
   Mars  1.5237  0.0935
Jupiter  5.2016   0.049
 Saturn  9.5424  0.0547
 Uranus 19.1727  0.0486
Neptune 29.9769  0.0088
 Halley 17.8589   0.968

In [6]:
print(planet_table)

  Name     a     col2
------- ------- ------
Mercury  0.3871 0.2056
  Venus  0.7233 0.0068
  Earth  0.9991 0.0166
   Mars  1.5237 0.0935
Jupiter  5.2016  0.049
 Saturn  9.5424 0.0547
 Uranus 19.1727 0.0486
Neptune 29.9769 0.0088
 Halley 17.8589  0.968

## Renaming columns

In [7]:
planet_table.rename_column('col2', 'ecc')
print(planet_table)

  Name     a     ecc
------- ------- ------
Mercury  0.3871 0.2056
  Venus  0.7233 0.0068
  Earth  0.9991 0.0166
   Mars  1.5237 0.0935
Jupiter  5.2016  0.049
 Saturn  9.5424 0.0547
 Uranus 19.1727 0.0486
Neptune 29.9769 0.0088
 Halley 17.8589  0.968

In [8]:
planet_table['Name']

<Column name='Name' dtype='str7' length=9>
Mercury
  Venus
  Earth
   Mars
Jupiter
 Saturn
 Uranus
Neptune
 Halley

In [9]:
planet_table['Name'][0]

'Mercury'

## Sorting

In [10]:
planet_table.sort(['ecc'])

In [11]:
planet_table

<QTable length=9>
  Name     a      ecc
  str7  float64 float64
------- ------- -------
  Venus  0.7233  0.0068
Neptune 29.9769  0.0088
  Earth  0.9991  0.0166
 Uranus 19.1727  0.0486
Jupiter  5.2016   0.049
 Saturn  9.5424  0.0547
   Mars  1.5237  0.0935
Mercury  0.3871  0.2056
 Halley 17.8589   0.968

## Masking

In [12]:
planet_table.sort(['a'])    # re-sort our table

In [13]:
mask1 = np.where(planet_table['a'] > 5)

mask1

(array([4, 5, 6, 7, 8], dtype=int64),)

In [14]:
planet_table[mask1]

<QTable length=5>
  Name     a      ecc
  str7  float64 float64
------- ------- -------
Jupiter  5.2016   0.049
 Saturn  9.5424  0.0547
 Halley 17.8589   0.968
 Uranus 19.1727  0.0486
Neptune 29.9769  0.0088

In [15]:
mask2 = ((planet_table['a'] > 5) &
         (planet_table['ecc'] < 0.05))

planet_table[mask2]

<QTable length=3>
  Name     a      ecc
  str7  float64 float64
------- ------- -------
Jupiter  5.2016   0.049
 Uranus 19.1727  0.0486
Neptune 29.9769  0.0088

## Adding a column to the Table

In [16]:
perihelion = planet_table['a'] * (1.0 - planet_table['ecc'])

In [17]:
perihelion

<Column name='a' dtype='float64' length=9>
 0.30751224
 0.71838156
 0.98251494
 1.38123405
  4.9467216
 9.02043072
  0.5714848
18.24090678
29.71310328

In [18]:
planet_table['Peri'] = perihelion

In [19]:
planet_table

<QTable length=9>
  Name     a      ecc       Peri
  str7  float64 float64   float64
------- ------- ------- -----------
Mercury  0.3871  0.2056  0.30751224
  Venus  0.7233  0.0068  0.71838156
  Earth  0.9991  0.0166  0.98251494
   Mars  1.5237  0.0935  1.38123405
Jupiter  5.2016   0.049   4.9467216
 Saturn  9.5424  0.0547  9.02043072
 Halley 17.8589   0.968   0.5714848
 Uranus 19.1727  0.0486 18.24090678
Neptune 29.9769  0.0088 29.71310328

## Saving a table

In [20]:
planet_table.write('NewPlanets.csv', format='ascii.csv')

WARNING: AstropyDeprecationWarning: NewPlanets.csv already exists. Automatically overwriting ASCII files is deprecated. Use the argument 'overwrite=True' in the future. [astropy.io.ascii.ui]

In [21]:
os.listdir()

['.git',
 '.gitignore',
 '.ipynb_checkpoints',
 '00_UnixNotes.txt',
 'Astro_Coordinates.pdf',
 'Doctor.csv',
 'Emily_Farr_IntroPython.ipynb',
 'Emily_Farr_ReadingData-Copy1.ipynb',
 'Emily_Farr_ReadingData.ipynb',
 'FirstLast_IntroPython.ipynb',
 'FirstLast_Strings.ipynb',
 'FirstLast_Units.ipynb',
 'GOLF',
 'images',
 'LICENSE',
 'MainBelt.csv',
 'Mess.csv',
 'MyData',
 'NewPlanets.csv',
 'NewPlanets2.csv',
 'Planets.csv',
 'Python_Introduction.ipynb',
 'Python_ReadingData.ipynb',
 'Python_StringsAndStuff.ipynb',
 'Python_Units.ipynb',
 'README.md',
 'RegEx.bash',
 'RegExCheet.pdf',
 'RegEx_Assignment.txt',
 'RegEx_Notes.txt',
 'Sillybus.pdf',
 'StyleGuide.ipynb',
 'TestMyComputer.ipynb',
 'UnixCommands.pdf',
 'words.txt']

---

# The `Pandas` package - `DataFrame`

In [1]:
import pandas as pd

In [2]:
planet_table2 = pd.read_csv('Planets.csv')

In [3]:
planet_table2

      Name        a  Unnamed: 2
0  Mercury   0.3871      0.2056
1    Venus   0.7233      0.0068
2    Earth   0.9991      0.0166
3     Mars   1.5237      0.0935
4  Jupiter   5.2016      0.0490
5   Saturn   9.5424      0.0547
6   Uranus  19.1727      0.0486
7  Neptune  29.9769      0.0088
8   Halley  17.8589      0.9680

In [4]:
print(planet_table2)

      Name        a  Unnamed: 2
0  Mercury   0.3871      0.2056
1    Venus   0.7233      0.0068
2    Earth   0.9991      0.0166
3     Mars   1.5237      0.0935
4  Jupiter   5.2016      0.0490
5   Saturn   9.5424      0.0547
6   Uranus  19.1727      0.0486
7  Neptune  29.9769      0.0088
8   Halley  17.8589      0.9680

## Renaming columns

In [5]:
planet_table2.rename(columns={'Unnamed: 2': 'ecc'}, inplace=True) #inplace true renames the column everywhere. If not added in it will only change in current command box.

planet_table2

      Name        a     ecc
0  Mercury   0.3871  0.2056
1    Venus   0.7233  0.0068
2    Earth   0.9991  0.0166
3     Mars   1.5237  0.0935
4  Jupiter   5.2016  0.0490
5   Saturn   9.5424  0.0547
6   Uranus  19.1727  0.0486
7  Neptune  29.9769  0.0088
8   Halley  17.8589  0.9680

In [6]:
planet_table2['Name']

0    Mercury
1      Venus
2      Earth
3       Mars
4    Jupiter
5     Saturn
6     Uranus
7    Neptune
8     Halley
Name: Name, dtype: object

In [7]:
planet_table['Name'][0]

NameError: name 'planet_table' is not defined

## Sorting

In [8]:
planet_table2.sort_values(['ecc'])

      Name        a     ecc
1    Venus   0.7233  0.0068
7  Neptune  29.9769  0.0088
2    Earth   0.9991  0.0166
6   Uranus  19.1727  0.0486
4  Jupiter   5.2016  0.0490
5   Saturn   9.5424  0.0547
3     Mars   1.5237  0.0935
0  Mercury   0.3871  0.2056
8   Halley  17.8589  0.9680

In [9]:
planet_table2

      Name        a     ecc
0  Mercury   0.3871  0.2056
1    Venus   0.7233  0.0068
2    Earth   0.9991  0.0166
3     Mars   1.5237  0.0935
4  Jupiter   5.2016  0.0490
5   Saturn   9.5424  0.0547
6   Uranus  19.1727  0.0486
7  Neptune  29.9769  0.0088
8   Halley  17.8589  0.9680

In [10]:
planet_table2.sort_values(['ecc'], ascending=False)

      Name        a     ecc
8   Halley  17.8589  0.9680
0  Mercury   0.3871  0.2056
3     Mars   1.5237  0.0935
5   Saturn   9.5424  0.0547
4  Jupiter   5.2016  0.0490
6   Uranus  19.1727  0.0486
2    Earth   0.9991  0.0166
7  Neptune  29.9769  0.0088
1    Venus   0.7233  0.0068

## Masking

In [11]:
mask3 = planet_table['a'] > 5

mask3

NameError: name 'planet_table' is not defined

In [12]:
planet_table2[mask3]

NameError: name 'mask3' is not defined

In [13]:
mask4 = ((planet_table2['a'] > 5) &
         (planet_table2['ecc'] < 0.05))

planet_table2[mask4]

      Name        a     ecc
4  Jupiter   5.2016  0.0490
6   Uranus  19.1727  0.0486
7  Neptune  29.9769  0.0088

## Adding a column to the Table

In [14]:
perihelion = planet_table2['a'] * (1.0 - planet_table2['ecc'])

In [15]:
perihelion

0     0.307512
1     0.718382
2     0.982515
3     1.381234
4     4.946722
5     9.020431
6    18.240907
7    29.713103
8     0.571485
dtype: float64

In [16]:
planet_table2['Peri'] = perihelion

In [17]:
planet_table2

      Name        a     ecc       Peri
0  Mercury   0.3871  0.2056   0.307512
1    Venus   0.7233  0.0068   0.718382
2    Earth   0.9991  0.0166   0.982515
3     Mars   1.5237  0.0935   1.381234
4  Jupiter   5.2016  0.0490   4.946722
5   Saturn   9.5424  0.0547   9.020431
6   Uranus  19.1727  0.0486  18.240907
7  Neptune  29.9769  0.0088  29.713103
8   Halley  17.8589  0.9680   0.571485

## Saving a table

In [18]:
planet_table2.to_csv('NewPlanets2.csv', index=False) #index true will keep the index

In [19]:
os.listdir()

NameError: name 'os' is not defined

---

# QTables vs. DataFrames

* As you can see, the `astropy` **QTable** and the `pandas` **DataFrame** are very similar.
* There are some important differences that we will discover this quarter.
* Astronomers use both packages, depending on the situation.
* `Pandas` is the dominate packages outside astronomy.

# Part I - Advantage Pandas

## `Pandas` is really good for working with dates!

In [20]:
import datetime

In [21]:
doctor_table = pd.read_csv('Doctor.csv')

In [22]:
doctor_table

                 Name        BirthDate  Age    BirthCity BirthCountry
0    William Hartnell        8/01/1908   55       London      England
1   Patrick Troughton    25 March 1920   46       London      England
2         Jon Pertwee      7 July 1919   50       London      England
3           Tom Baker  20-January-1934   40    Liverpool      England
4       Peter Davison    13 April 1951   29       London      England
5         Colin Baker      8/June/1943   40       London      England
6     Sylvester McCoy   20 August 1943   44       Dunoon     Scotland
7         Paul McGann       14/11/1959   36    Liverpool      England
8           John Hurt  22 January 1940   73   Derbyshire      England
9     Chris Eccleston      16 Feb 1964   41      Salford      England
10      David Tennant    18 April 1971   34     Bathgate     Scotland
11         Matt Smith       28-10-1982   27  Northampton      England
12      Peter Capaldi    14 April 1958   55      Glasgow     Scotland
13    Jodie Whittaker       06/03/1982   35    Yorkshire      England

In [23]:
doctor_table.sort_values(['BirthDate'])

                 Name        BirthDate  Age    BirthCity BirthCountry
13    Jodie Whittaker       06/03/1982   35    Yorkshire      England
4       Peter Davison    13 April 1951   29       London      England
12      Peter Capaldi    14 April 1958   55      Glasgow     Scotland
7         Paul McGann       14/11/1959   36    Liverpool      England
9     Chris Eccleston      16 Feb 1964   41      Salford      England
10      David Tennant    18 April 1971   34     Bathgate     Scotland
6     Sylvester McCoy   20 August 1943   44       Dunoon     Scotland
3           Tom Baker  20-January-1934   40    Liverpool      England
8           John Hurt  22 January 1940   73   Derbyshire      England
1   Patrick Troughton    25 March 1920   46       London      England
11         Matt Smith       28-10-1982   27  Northampton      England
2         Jon Pertwee      7 July 1919   50       London      England
0    William Hartnell        8/01/1908   55       London      England
5         Colin Baker      8/June/1943   40       London      England

In [24]:
doctor_table['BirthDate'] = pd.to_datetime(doctor_table['BirthDate'])

In [25]:
doctor_table.sort_values(['BirthDate'])

                 Name  BirthDate  Age    BirthCity BirthCountry
0    William Hartnell 1908-08-01   55       London      England
2         Jon Pertwee 1919-07-07   50       London      England
1   Patrick Troughton 1920-03-25   46       London      England
3           Tom Baker 1934-01-20   40    Liverpool      England
8           John Hurt 1940-01-22   73   Derbyshire      England
5         Colin Baker 1943-06-08   40       London      England
6     Sylvester McCoy 1943-08-20   44       Dunoon     Scotland
4       Peter Davison 1951-04-13   29       London      England
12      Peter Capaldi 1958-04-14   55      Glasgow     Scotland
7         Paul McGann 1959-11-14   36    Liverpool      England
9     Chris Eccleston 1964-02-16   41      Salford      England
10      David Tennant 1971-04-18   34     Bathgate     Scotland
13    Jodie Whittaker 1982-06-03   35    Yorkshire      England
11         Matt Smith 1982-10-28   27  Northampton      England

In [26]:
today = datetime.date.today()

today

datetime.date(2017, 10, 18)

In [27]:
age = today - doctor_table['BirthDate']

In [28]:
age

0    39890 days
1    35636 days
2    35898 days
3    30587 days
4    24295 days
5    27161 days
6    27088 days
7    21158 days
8    28394 days
9    19603 days
10   16985 days
11   12774 days
12   21737 days
13   12921 days
Name: BirthDate, dtype: timedelta64[ns]

In [29]:
doctor_table['AgeToday'] = age / np.timedelta64(1, 'Y')

NameError: name 'np' is not defined

In [30]:
doctor_table

                 Name  BirthDate  Age    BirthCity BirthCountry
0    William Hartnell 1908-08-01   55       London      England
1   Patrick Troughton 1920-03-25   46       London      England
2         Jon Pertwee 1919-07-07   50       London      England
3           Tom Baker 1934-01-20   40    Liverpool      England
4       Peter Davison 1951-04-13   29       London      England
5         Colin Baker 1943-06-08   40       London      England
6     Sylvester McCoy 1943-08-20   44       Dunoon     Scotland
7         Paul McGann 1959-11-14   36    Liverpool      England
8           John Hurt 1940-01-22   73   Derbyshire      England
9     Chris Eccleston 1964-02-16   41      Salford      England
10      David Tennant 1971-04-18   34     Bathgate     Scotland
11         Matt Smith 1982-10-28   27  Northampton      England
12      Peter Capaldi 1958-04-14   55      Glasgow     Scotland
13    Jodie Whittaker 1982-06-03   35    Yorkshire      England

In [31]:
doctor_table.describe()

             Age
count  14.000000
mean   43.214286
std    12.135001
min    27.000000
25%    35.250000
50%    40.500000
75%    49.000000
max    73.000000

---

# Messy Data

* `Pandas` is a good choice when working with messy data files.
* In the "real world" all data is messy.
* For example, here is the contents of the file `Mess.csv`:

#######################################################
#
# Col 1 - Name
# Col 2 - Size (km)
#
#######################################################
"Sample 1",10
"",23
,
"Another Sample",

## This is not going to end well ...

In [32]:
messy_table = pd.read_csv('Mess.csv')

ParserError: Error tokenizing data. C error: Expected 1 fields in line 7, saw 2

## Skip the header

In [33]:
messy_table = pd.read_csv('Mess.csv', skiprows = 6)

messy_table

         Sample 1    10
0             NaN  23.0
1             NaN   NaN
2  Another Sample   NaN

`NaN` = Not_A_Number, python's null value

## Column names are messed up

### Option 1 - Turn off the header

In [34]:
messy_table = pd.read_csv('Mess.csv', skiprows = 6, header= None)

messy_table

                0     1
0        Sample 1  10.0
1             NaN  23.0
2             NaN   NaN
3  Another Sample   NaN

### Option 2 - Add the column names

In [35]:
cols = ["Name", "Size"]

messy_table = pd.read_csv('Mess.csv', skiprows = 6, names = cols)

messy_table

             Name  Size
0        Sample 1  10.0
1             NaN  23.0
2             NaN   NaN
3  Another Sample   NaN

### Deal with the missing data with `fillna()`

In [36]:
messy_table['Name'].fillna("unknown", inplace=True)
messy_table['Size'].fillna(999.0, inplace=True)

messy_table

             Name   Size
0        Sample 1   10.0
1         unknown   23.0
2         unknown  999.0
3  Another Sample  999.0